# Einträge löschen

Einen oder mehrere Einträge aus einer Achse zu löschen ist einfach, wenn ihr bereits ein Index-Array oder eine Liste ohne diese Einträge habt.

Zum Löschen von Duplikaten siehe [Daten deduplizieren](../../clean-prep/deduplicate.ipynb).

Da dies ein wenig Mengenlehre erfordern kann, geben wir die Drop-Methode als neues Objekt ohne den oder die gelöschten Werten zurück:

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series(np.random.randn(7))

s

0    1.539868
1    0.425099
2   -0.214686
3    0.332304
4   -1.218634
5   -0.661373
6    0.323181
dtype: float64

In [3]:
new = s.drop(2)

new

0    1.539868
1    0.425099
3    0.332304
4   -1.218634
5   -0.661373
6    0.323181
dtype: float64

In [4]:
new = s.drop([2, 3])

new

0    1.539868
1    0.425099
4   -1.218634
5   -0.661373
6    0.323181
dtype: float64

Bei DataFrames können Indexwerte auf beiden Achsen gelöscht werden. Um dies zu veranschaulichen, erstellen wir zunächst einen Beispiel-DataFrame:

In [5]:
data = {'Code': ['U+0000', 'U+0001', 'U+0002', 'U+0003', 'U+0004', 'U+0005'],
        'Decimal': [0, 1, 2, 3, 4, 5],
        'Octal': ['001', '002', '003', '004', '004', '005'],
        'Key': ['NUL', 'Ctrl-A', 'Ctrl-B', 'Ctrl-C', 'Ctrl-D', 'Ctrl-E']}

df = pd.DataFrame(data)

df

     Code  Decimal Octal     Key
0  U+0000        0   001     NUL
1  U+0001        1   002  Ctrl-A
2  U+0002        2   003  Ctrl-B
3  U+0003        3   004  Ctrl-C
4  U+0004        4   004  Ctrl-D
5  U+0005        5   005  Ctrl-E

In [6]:
df.drop([0, 1])

     Code  Decimal Octal     Key
2  U+0002        2   003  Ctrl-B
3  U+0003        3   004  Ctrl-C
4  U+0004        4   004  Ctrl-D
5  U+0005        5   005  Ctrl-E

Ihr könnt auch Werte aus den Spalten entfernen, indem ihr `axis=1` oder `axis='columns'` übergebt:

In [7]:
df.drop('Decimal', axis=1)

     Code Octal     Key
0  U+0000   001     NUL
1  U+0001   002  Ctrl-A
2  U+0002   003  Ctrl-B
3  U+0003   004  Ctrl-C
4  U+0004   004  Ctrl-D
5  U+0005   005  Ctrl-E

Viele Funktionen wie `drop`, die die Größe oder Form einer Reihe oder eines DataFrame ändern, können ein Objekt an Ort und Stelle manipulieren, ohne ein neues Objekt zurückzugeben:

In [8]:
df.drop(0, inplace=True)

df

     Code  Decimal Octal     Key
1  U+0001        1   002  Ctrl-A
2  U+0002        2   003  Ctrl-B
3  U+0003        3   004  Ctrl-C
4  U+0004        4   004  Ctrl-D
5  U+0005        5   005  Ctrl-E

> **Warnung:**
> 
> Seid  vorsichtig mit der `inplace`-Funktion, da die Daten unwiderbringlich gelöscht werden.